/*******************************************************************************
实现功能：	通过定时器实现PWM波控制呼吸灯
			一条通道为直接纯输出PWM波控制LED
			另一条通道通过RC低通滤波后接上电压跟随器，实现数字量转换为模拟量控制小灯
			
引脚定义：	LED	→ P1^0
			PWM → P1^1
*******************************************************************************/

#include <REGX52.H>
#include "UserDef.H"
#include "Timer.H"
#include "Delay.H"
						 
/*******************************************************************************
* 函 数 名         :  main （主函数）
* 函数功能		   :  主程循环执行
* 输    入         :  无
* 输    出         :  无
*******************************************************************************/
void main(void)
{
	Timer0_Initialization();
	while(1)
	{
		for(Compare = 0; Compare <= 100; Compare++)		//比较值从0到100在从100到0实现呼吸灯效果
		{
			DelayXms(10);		//调节呼吸灯的快慢
		}
		for(Compare = 100; Compare >= 0; Compare--)
		{
			DelayXms(10);
		}
	}
}