#include <REGX52.H>
#include "UserDef.H"
#include "Timer.H"

INT8S Compare;

/*******************************************************************************
* 函 数 名         : Timer0_Initialization 定时器初始化函数
* 函数功能		   : 定时器初始化设置（1毫秒@12.000MHz）
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
extern void Timer0_Initialization(void)
{
	EA = 1;  		//总中断打开
	ET0 = 1; 		//定时器0打开
	TMOD &= 0xF0;	//与或赋值
	TMOD |= 0x01;	//设置定时器模式1
	TL0 = 0x18;		//设置定时初值，延时1ms
	TH0 = 0xFC;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
}

/*******************************************************************************
* 函 数 名         : Timer_Routine 定时器主函数
* 函数功能		   : 计时器计时一定时间执行内容
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Timer0_Routine() interrupt 1
{
	static INT8U count;
	TL0 = 0x9C;		//重置定时初始值100微秒 
	TH0 = 0xFF;
    count++;
	count %= 100;	//实现超过100归零  可以取代if判断  一个PWM的周期为100*100us即10ms
	if(count < Compare)
	{
		LED = 1;		//直接IO口输出PWM波控制小灯
		DA_PWM = 0;		//IO口输出PWM波通过低通滤波在经过电压跟随器控制小灯
	}
	else
	{
		LED = 0;
		DA_PWM = 1;
	}
}