/*******************************************************************************
实现功能 ：	LCD1602液晶显示器，可以显示字符数字等内容

引脚定义 ：	LCD_RS	→	P2^6
			LCD_RW	→	P2^5                              
			LCD_E	→	P2^7
			LCD_DataPort	→	P0
*******************************************************************************/

#include <REGX52.H>
#include "UserDef.H"
#include "LCD1602.H"                    

/*******************************************************************************
* 函 数 名         :  main主函数
* 函数功能		   :  执行初始化函数与循环函数 
* 输    入         :  无
* 输    出         :  无
*******************************************************************************/
void main(void)
{
	LCD_Initialization();
	while(1)
	{
		LCD_ShowString(1, 10, "LCK SB");
		LCD_ShowNumber(1, 1, 9, 3);
		LCD_ShowChar(2, 1, '+');
	}
}
