#include <REGX52.H>
#include "Timer.H"

/*******************************************************************************
* 函 数 名         : Timer0_Initialization 定时器初始化函数
* 函数功能		   : 定时器初始化设置（1毫秒@12.000MHz）
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
extern void Timer0_Initialization(void)
{
	EA = 1;  		//总中断打开
	ET0 = 1; 		//定时器0打开
	TMOD &= 0xF0;	//与或赋值
	TMOD |= 0x01;	//设置定时器模式1
	TL0 = 0x9C;		//重置定时初始值100微秒 
	TH0 = 0xFF;
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
}