#include <REGX52.H>
#include <INTRINS.H>
#include "UserDef.H"
#include "Buzzer.H"

/*******************************************************************************
* 函 数 名		: Buzzer_Delay500us 蜂鸣器独有延时函数
* 函数功能		: 12MHz晶振，延时500us  为了延时取反达成1000HZ的频率
* 输    入 		: 无
* 输    出		: 无
*******************************************************************************/
static void Buzzer_Delay500us()	
{
	INT8U i;

	_nop_();
	i = 247;
	while (--i);
}

/*******************************************************************************
* 函 数 名		: 
* 函数功能		: 
* 输    入 		: 
* 输    出		: 
*******************************************************************************/
extern void Buzzer_Time(INT16U time)
{
	INT16U i;
	for(i = 0; i < time*2; i++)   //0.5ms记一次，并取反，一次完整的周期就是1ms
	{
		Buzzer = !Buzzer;
		Buzzer_Delay500us();
	}
}