#include <REGX52.H>
#include "UserDef.H"
#include "Delay.H"

#define duan P1
#define wei P0
sbit _138_A = P2^0;
sbit _138_B = P2^1;
sbit _138_C = P2^2;

//INT8U NixieTable[]={0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90,0x88,0x83,0xc6,0xa1,0x86,0x8e};//共阳数码管代码表"0-F"(a为最低位))
INT8U NixieTable[]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};//共阴数码管代码表"0-F"(a为最低位)

/*******************************************************************************
* 函 数 名		: ShowChar （动态数码管显示函数）
* 函数功能		: 输入显示位置与显示字符显就可以显示相应数字
* 输    入 		: Show_site（显示位置  范围：1—8）
				  Show_Char（显示字符 范围：0—15 对应0—F）
* 输    出		: 无
*******************************************************************************/
void ShowChar(INT8U Show_site, Show_Char)
{
	wei = ~(0x80 >> Show_site - 1 );
	duan = NixieTable[Show_Char];
	DelayXms(1);
	duan = 0x00;
}

/*******************************************************************************
* 函 数 名		: _74HC138_ShowChar (138译码器控制动态数码管显示函数)
* 函数功能		: 138控制数码管的位选A为低位，C为高位
* 输    入 		: Show_site（显示位置  范围：1—8）
				  Show_Char（显示字符 范围：0—15 对应0—F）
* 输    出		: 无
*******************************************************************************/
void _74HC138_ShowChar(INT8U Show_site, Show_Char)
{
	_138_A = (Show_site - 1) % 2;
	_138_B = ((Show_site - 1) / 2) % 2;
	_138_C = ((Show_site - 1) / 2) / 2;
	duan = NixieTable[Show_Char];
	DelayXms(1);
	duan = 0x00;
}

/*******************************************************************************
* 函 数 名         :  main主函数
* 函数功能		   :  执行初始化函数与循环函数 
* 输    入         :  无
* 输    出         :  无
*******************************************************************************/
void main(void)
{
	INT8U i;
	while(1)
	{
//		ShowChar(1, 6);
//		ShowChar(2, 5);
//		ShowChar(3, 15);
		for(i = 1; i <= 8 ; i++)
		{
			_74HC138_ShowChar(i, i); 
		}
	}
}