#include <REGX52.H>
#include "UserDef.H"
#include "74HC595.H"

/*******************************************************************************
* 函 数 名		: _74HC595_Initialization （595芯片初始化）
* 函数功能		: 595芯片复位初始化
* 输    入 		: 无
* 输    出		: 无
*******************************************************************************/
extern void _74HC595_Initialization()
{
	_595_SRCLK = 0;
	_595_RCLK = 0;
}

/*******************************************************************************
* 函 数 名		: _74HC595_SendByte （595写字节函数）
* 函数功能		: 595写入字节
* 输    入 		: amount  (595写入字节数）
				  _595_Byte1（写入字节1）
				  _595_Byte2（写入字节2，若没有输入0）
				  _595_Byte3（写入字节2，若没有输入0）
* 输    出		: 无
*******************************************************************************/
static void _74HC595_SendByte(INT8U amount, _595_Byte1, _595_Byte2, _595_Byte3)
{
	INT8U i;
	if(amount >= 1)
	{
		for(i = 0; i < 8; i++)
		{
			_595_SER = _595_Byte1 & (0x80 >> i);
			_595_SRCLK = 1;
			_595_SRCLK = 0;
		}
	}
	if(amount >= 2)
	{
		for(i = 0; i < 8; i++)
		{
			_595_SER = _595_Byte2 & (0x80 >> i);
			_595_SRCLK = 1;
			_595_SRCLK = 0;
		}
	}
	_595_RCLK = 1;
	_595_RCLK = 0;
}